---
kind: property
id: P:Autodesk.Revit.DB.SpacingRule.Offset
zh: 偏移、偏移量
source: html/e8e9b620-24c2-bd3e-f8aa-df97dc12702b.htm
---
# Autodesk.Revit.DB.SpacingRule.Offset Property

**中文**: 偏移、偏移量

An additional offset applied to the first
gridline.

## Syntax (C#)
```csharp
public double Offset { get; set; }
```

## Remarks
Measured in feet. Must be between -30000' and
30000'.